{"resposta1":"Ao digitarmos uma URL de um website na barra de endereço do navegador, nosso computador envia uma requisição ao roteador, que \"transforma\" nosso IP Privado em IP Público e então envia essa requisição para a provedora de internet, sendo que para resolver o nome do endereço (\"www.duckduckgo.com\" por exemplo) faz um pedido de \"tradução\" para um servidor DNS(o do google é \"8.8.8.8\" e \"1.1.1.1\" do Cloudflare por exemplo) o DNS traduz para 40.114.177.156 que é o IP do servidor onde o site está hospedado. O mesmo responde a requisição enviando o conteúdo do site para o IP que solicitou. Como em uma casa pode-se ter vários computadores\/aparelhos, o roteador mapeia cada computador com um IP privado, acompanhado pela identificação do MAC da interface de rede do aparelho.\r\nEm outras palavras...\r\nSolicitamos um website pelo navegador. A requisição passa para roteador, depois o IP privado da máquina que solicitou o site é convertido para acessar a internet por meio de um ip público, e quando a requisição retorna para o modem no roteador, este saberá pra qual IP privado da rede enviar os dados recebidos","resposta2amaster":"ns1.ecomt1.com.br","resposta2aslave":"ns2.ecomt1.com.br","resposta2b":"São hostnames que Estão na mesma zona de DNS (ecomt1.com.br), que é responsável por fazer com que o domínio possa ser localizado na internet","resposta3":"A principal causa é que o usuário destinatário do email enviado no domínio bucaneiropesca.com.br não existe. Ou seja o que foi digitado antes do \"@\" pode ter sido digitado erroneamente.","resposta4a":"98732.tcdn.com.br","resposta4b":"177.67.115.98","resposta4c":"Utilizando as ferramentas ping e principalmente o nslookup é possível saber os registros de DNS CNAME record e A record e o IP servidor de um site, apliquei aos sites disponibilizados e descobri que o CNAME para apontamento utilizado é ID_DA_LOJA.tcdn.com.br.\r\nAo utilizar o ping no 98732.tcdn.com.br, descobri que o IP deste CNAME é 177.67.115.98, fazendo o apontamento A record para este IP","resposta5":"Monitorar o uso de recursos dos servidores hospedando a aplicação e suas dependências, como banco de dados, etc.\r\nPara monitorar uma aplicação web é necessário monitorar a Disponibilidade(porcentagem do tempo em que a aplicação fica no ar sem cair ou apresentar instabilidade). Também é necessário monitorar os logs de erros da aplicação para saber onde estão determinados bugs. Monitorar a latência e erros das requisições e suas respostas ao servidor web. Monitorar as dependências da aplicação como consultas ao Banco de Dados(MySQL, SQLServer MongoDB, etc),  transações através do Banco de chave\/valor(Redis)\r\nNestes casos um dashboard contendo monitoramento de erros e monitoramento de latência nas requisições é bem útil. Sempre me atentando à requisições críticas como por exemplo uma página de Carrinho de compras em um ecommerce.\r\nEssas métricas devem ser escolhidas com cuidado, relativo a cada aplicação web e suas regras de negócio, levando em conta um budget para errors, por exemplo.","resposta6":"Ao utilizar o sudo rm -rf \/* removemos de maneira recursiva e forçada todo o conteúdo do diretório raiz do sistema operacional instalado no HD, sendo assim, fazendo-se impossível a inicialização do sistema operacional ao reiniciar, visto que foi removido inclusive os arquivos responsáveis pelo boot do sistema."}